package algorithms;

/* Реализуйте метод, сливающий два отсортированных по неубыванию массива чисел в один отсортированный в том же порядке массив. Массивы могут быть любой длины, в том числе нулевой.

Предполагается, что вы реализуете алгоритм слияния, имеющий линейную сложность: он будет идти по двум исходным массивам и сразу формировать отсортированный результирующий массив. Так, чтобы сортировка полученного массива при помощи Arrays.sort() уже не требовалась.

К сожалению, автоматически это не проверить, так что это остается на вашей совести :)

Воспользуйтесь предоставленным шаблоном. Декларацию класса, метод main и обработку ввода-вывода добавит проверяющая система.

Пример

Если на вход подаются массивы {0, 2, 2} и {1, 3}, то на выходе должен получиться массив {0, 1, 2, 2, 3} */



public class MergeArray {

    /*public static int[] mergeArray(int[] a, int[] b) {
        int in, out, min;
        int[] result = new int[a.length + b.length];

       for (out = 0; )
    }*/


    public static void main(String[] args) {
        int[] a = {0, 2, 2};
        int[] b = {1, 3, 4};

        //System.out.println(mergeArray(a, b));
    }
}
